# Properly initializes the completion system for other plugins.
mattmc3/ez-compinit

# Additional completion definitions for zsh.
zsh-users/zsh-completions

# Fast and elegant zsh prompt.
sindresorhus/pure

# Colorizes completions, man pages, and output of some commands.
mattmc3/zephyr path:plugins/color

# Automatically inserts matching brackets and quotes.
hlissner/zsh-autopair

# Fish-style autosuggestions, syntax highlighting, and history search.
zsh-users/zsh-autosuggestions
zsh-users/zsh-syntax-highlighting
zsh-users/zsh-history-substring-search
